DataProcessors/АК_ИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АК_ИсторияЗвонков</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ИсторияЗвонков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>calldate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>src</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>dst</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходящийПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходящийОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>disposition</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>duration</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>recordingfile</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NotAnswered</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/АК_ИсторияЗвонков/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ПериодИстории.ДатаНачала)
		И Не ЗначениеЗаполнено(ПериодИстории.ДатаНачала) Тогда
		ПериодИстории.ДатаНачала = НачалоДня(НачалоДня(ТекущаяДата())-1);
		ПериодИстории.ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
	Если Элементы.ИсторияЗвонков.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НомерДляЗвонка = Элементы.ИсторияЗвонков.ТекущиеДанные.src;
	Если Элементы.ИсторияЗвонков.ТекущийЭлемент.Имя = "ИсторияЗвонковИсходящийПредставление" Тогда
		НомерДляЗвонка = Элементы.ИсторияЗвонков.ТекущиеДанные.dst;
	КонецЕсли;
	АК_ТелефонияКлиент.Звонить(НомерДляЗвонка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	Объект.ИсторияЗвонков.Загрузить(АК_ТелефонияСервер.ПрочитатьЛогAsterisk(ПериодИстории.ДатаНачала,ПериодИстории.ДатаОкончания,,Элементы.ИсторияЗвонковНеотвеченные.Пометка));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаКлиенте()
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Воспроизвести(Команда)
	Если Элементы.ИсторияЗвонков.ТекущиеДанные = Неопределено
		Или Элементы.ИсторияЗвонков.ТекущиеДанные.recordingfile = "" Тогда
		Возврат;
	КонецЕсли;
	
	ФайлДляВоспроизведения = АК_ТелефонияКлиент.ПолучитьИмяФайлаЗаписиРазговора(Формат(Элементы.ИсторияЗвонков.ТекущиеДанные.calldate,"ДФ=/гггг/ММ/дд/"),Элементы.ИсторияЗвонков.ТекущиеДанные.recordingfile);
	
	Если ЗначениеЗаполнено(ФайлДляВоспроизведения) Тогда
		ЗапуститьПриложение("""C:\Program Files (x86)\Google\Chrome\Application\chrome.exe"" """ + ФайлДляВоспроизведения + """");
	Иначе
		Сообщить("Файл не найден.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Неотвеченные(Команда)
	Элементы.ИсторияЗвонковНеотвеченные.Пометка = Не Элементы.ИсторияЗвонковНеотвеченные.Пометка;
	ОбновитьНаСервере();
	Если Элементы.ИсторияЗвонковНеотвеченные.Пометка Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура("NotAnswered", Истина);
	КонецЕсли;	
	Элементы.ИсторияЗвонков.ОтборСтрок = ОтборСтрок;
КонецПроцедуры

&НаКлиенте
Процедура ПериодИсторииПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗвонковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.ИсторияЗвонков.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбъектЗвонка = Элементы.ИсторияЗвонков.ТекущиеДанные.ВходящийОбъект;
	Если Элементы.ИсторияЗвонков.ТекущийЭлемент.Имя = "ИсторияЗвонковИсходящийПредставление" Тогда
		ОбъектЗвонка = Элементы.ИсторияЗвонков.ТекущиеДанные.ИсходящийОбъект;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОбъектЗвонка) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ОбъектЗвонка) = Тип("Строка") Тогда
		СтруктураПараметровФормы = Новый Структура;
		СтруктураПараметровФормы.Вставить("CustomerUID",ОбъектЗвонка);
		СтруктураПараметровФормы.Вставить("rowguid","");
		СтруктураПараметровФормы.Вставить("Email","");
		
		ОткрытьФорму("Обработка.ОтчетыПоКартам.Форма.КарточкаКлиента", СтруктураПараметровФормы);
	Иначе
		ОткрытьЗначение(ОбъектЗвонка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьНаКлиенте",120);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОтключитьОбработчикОжидания("ОбновитьНаКлиенте");
КонецПроцедуры
